[
  {
    "id": "product_1_razer",
    "category": "Electronics",
    "link": "https://www.amazon.com/Razer-Kraken-Kitty-Wireless-Headset/dp/B0CCWDJ6GF/ref=sr_1_2?dib=eyJ2IjoiMSJ9.WxApTmROK8kkxfqXgkfW9Ot9oO-m_xtyUf3HvJKi3P1I3VY1I73f6NShClwlj66HQelxD7A0w9c5vi82C38fH_he0PhMAl2ChN5vK10AcbvHZu3TGvSCi2ZkeYfnJPAK3En9EVWaA-VIICDFWVh5ONunWtD7iIVu4AK0C_ecZNS-jKbaX9cuucwzTkOnE4vQghGdDTOS67vYmuIKVdHoh3otQ9yN2QB9eDyGMEqwHe8.pDwoqrrshqxvHReS6mlr3GwhK4AwSN83MbPOpH_XSvM&dib_tag=se&hvadid=409994666855&hvdev=c&hvexpln=0&hvlocphy=9005929&hvnetw=g&hvocijid=13228950165106293982--&hvqmt=b&hvrand=13228950165106293982&hvtargid=kwd-2174840529486&hydadcr=17109_11235315&keywords=razer%2Bkraken%2Bkitty%2Bv2%2Bbt&mcid=9c00e543f5ef3f2ca4081c80e0eb37a8&qid=1764297769&sr=8-2&ufe=app_do%3Aamzn1.fos.9fe8cbfa-bf43-43d1-a707-3f4e65a4b666&th=1",
    "name": "Razer Kraken Kitty V2 Pro Wired Gaming Headset",
    "description": "Unleash your killer kitty style anywhere with the Razer Kraken Kitty V2 BT - a wireless Bluetooth headset for gaming and IRL streaming. Powered by Razer Chroma RGB, display your unique personality for all to see, as you take your passion to the next level with a full suite of upgraded features.",
    "reviews": [
      "This headset is everything I wanted and more. The Razer Kraken Kitty V2 BT is not just adorable with its glowing kitty ears and quartz pink color, it’s also super functional. It connects easily through Bluetooth, and I’ve had zero issues with lag or disconnects.",
      "The detail of the cat ears with RGB Chroma lighting is simply delightful. Colors and effects can be customized, making them stand out in streams or video calls. The white finishes are sleek and feel sturdy.",
      "The cat ears are super cute and the RGB lighting is bright.",
      "I primarily chose these headphones because they’re cute but I’ve been really impressed with the quality! My ears get sore after hours of wearing AirPods so I wanted to get something more comfortable and these definitely deliver. I can wear them all day while I work and hours of the evening while gaming or reading. They were easy to connect to multiple devices including my iPhone, my MacBook Air, my surface, my switch, and my tv. The sound quality is great and I haven’t had any issues listening to music, books, or games. They do a decent job of blocking out sound, but you’re not getting full sound elimination with these. The app is easy to set up if you want to customize the light settings. Overall I’m really happy with them!",
      "These headphones are SO CUTE but not really a gaming headset. They don't have a mute button or a boom mic. The razer Barracuda X is much better and the same price. Just buy that one and get the add on ears. They won't light up, but for the same price you'd have a much more functional headset. I'm so disappointed because I really wanted these to be great.",
      "Sound quality is terrible - connectivity issues out the gate. You wouldn’t be able to play games with this headset because of the sound cutting in and out. Unfortunately it is super cute, just stick with wired headsets from Razer.",
      "Very cute. Plug and play so easy to set up and use. They are very sturdy and well made.",
      "I use them all the time, especially when cleaning house. They match my pink keyboard and mouse and Hello Kitty Crocs. They sound amazing and I can wear then pretty much all day.",
      "This is my favorite headset, ever. I've never owned a Razer product before, so I wasn't sure what to expect. My boyfriend finally got me one for Christmas and my kitty dreams could finally come true !!! It's really so beautiful. The chroma app let's you change the colors however you want, which is super cool. The sound quality is great for music. I am an avid gamer though that's the only place it falls short. It lags just a bit with the game sound but it's enough to mess me up. There is a game mode but it's super annoying to put on because you have to go on the app the select it. It gets slightly better with that but still for games I'd rather just use my wired headset. But besides that, I love the ease of just grabbing these and listening to music around the house or at my desk. "
    ],
    "real_image_path": "images/razer_real.jpg"
  },
  {
    "id": "product_2_smeg",
    "category": "Home & Kitchen",
    "link":"https://www.amazon.com/Toaster-Presets-Function-Removable-TSF01CRUS/dp/B011SJYTI0/ref=sr_1_1?crid=3SRA10AI2IG8T&dib=eyJ2IjoiMSJ9.1cQS1LkNLqA2xagL0VG1F3K3es-RUglomU-iWVZrxzplfzbevX8i0JrfbhRGx12-Q4higaEzDZd1qcwNqsi0v3XFoXHSMFM7fIlxZW-r4TN9gNhGknOFEjxy1AXxntAmylviEU6AdntMnJU4C4-X1RKGAuyoZpG2WmrHindHacgMGx4gTx0wvDJAcHtCNY2ZfyUV1i0DDZS92Bm0GsZUJGuO1YeILVSoT3cVy3lGM8E.u-wR5_af9NSUMzt-VFyglhaS47QKtx3dwWo0v-0CpAE&dib_tag=se&keywords=Smeg%2B2-Slice%2BToaster%2C%2BCream&qid=1764298019&sprefix=smeg%2B2-slice%2Btoaster%2C%2Bcream%2Caps%2C194&sr=8-1&th=1",
    "name": "SMEG 2 Slice Toaster with 6 Presets and Defrost Function and Removable Crumb Tray (Cream)",
    "description": "Compact Footprint, Bold Impact – Measuring just 12 W x 8 D x 8 H, the SMEG TSF01 fits seamlessly on any countertop while standing out as a design icon. Harness the power of six distinct browning levels to achieve the perfect shade of toasty goodness. Operate your toaster with ease using the stylish chrome knob, boasting four convenient functions: Reheat, Defrost, Cancel, and Bagel. Our self-centering racks ensure uniform browning by securely holding your toast upright during the toasting process. Featuring a removable stainless-steel crumb tray for hassle-free maintenance, keeping your countertop pristine. 3 Pre-Set Functions – Reheat, Defrost, and Bagel modes offer versatility for all your breakfast favorites. Removable Stainless Steel Crumb Tray – Easy to clean and maintain, helping keep your countertop tidy. Non-Slip Feet for Stability – Anti-slip rubber feet ensure safe operation on any surface, even during busy mornings. Part of the SMEG Color Collection – Mix and match with SMEG’s Fab Fridge, ECF02 and EGF03 Espresso Machines, CJF11 Juicer, and more in matching or complementary colors. Made to Be Seen – Unlike ordinary toasters, the SMEG TSF01 is a functional showpiece designed to be displayed, not hidden.",
    "reviews": [
      "I love this toaster! For starters, it's beautiful to look at. It makes excellent toast (recommend between 3-4 setting for best toast). The slide out tray is easy to remove and clean. The unit and electric cord appear to be of very high quality. We chose cream colored paint and it's gorgeous, if one can say that about a toaster. My favorite feature of the toaster is the springiness of the pop-up mechanisms. When the toast is finished, the toast often flies above the toaster, much like in a cartoon! Most of the time, the toast lands back in the slot. While some may not like this, I absolutely find it adorable. This is my first SMEG toaster and doubt I will ever get another brand.",
      "This toaster was the perfect Christmas gift for my husband! The color is a nice neutral cream, and the quality is very good. It’s lightweight, and it toasts bread and bagels very evenly. I’m very happy with this purchase!",
      "This SMEG toaster is absolutely beautiful. Simple style but stunning at the same time. The cream color is so nice. Very easy to use. A no mess no fuss small appliance. Works well for me as I appreciate simplicity.",
      "Beautiful and does the job well.?if I could snuggle my toaster at night (with out being perceived as weird - and if it was not so cold and stiff), I would. Every time I come in the house, this little beauty is sitting on the counter greeting me. Making toast was never so chic! Easy to operate. Toast seems to cook evenly. Love it!!!",
      "I hesitated to buy because of the price but it is worth every penny. Not only is it gorgeous and made well (metal, not cheap plastic), it is the first toaster I have that toasts the break evenly. Highly recommend!",
      "A beautiful toaster but it stopped working after 10 months (was not used that much either). Toaster stopped toasting one side of the toast. The heating elements don’t heat up on the two inner most panels. It’s cute but if you want it to work, pass.",
      "Honestly great toaster. Love the color and ofc the brand. I found it too big and bulky though. Sadly returning it for the 2 slice toaster.",
      "This is so beautiful. The color is perfect, just as it appears on screen, has defrost and toast functions, and toasts my bread perfectly. It is so pretty that I am changing my kitchen decor to match my toaster. One of my friends called it the BMW of toasters. I agree.",
      "This machine is incredibly beautiful. That's why it gets five stars. And it toasts bread. Bonus. It has a bagel button where only one side of the bagel gets toasted. Perfect. And the little pop-out crumb dish is darling and, bonus, useful!!! And a button to push if you are toasting something frozen. Nice.",
      "I was attracted to your sleekness and beautiful shape. I found myself thinking about you every day. I hesitated to commit. Seriously though, this is a wonderful product. Superbly designed, sturdy and well made. The level of attention to detail is great, I particularly like that you can easily shorten the cord. But it's a toaster right? Yes it is, and it is possibly the best ever. It makes perfect toast. It toasts one side of a bagel, it defrosts and toasts. It's worth the money......and it's beautiful.",
      "Stopped working. Great looks however $225 is too expensive for a toaster that lasts less than 2 years and SMEG only warranties 12 months. Not what you expect from a perceived higher end brand and price point."
    ],
    "real_image_path": "images/smeg_real.jpg"
  },
  {
    "id": "product_3_crocs",
    "category": "Fashion",
    "link":"",
    "name": "Crocs Unisex-Adult Classic Clogs",
    "description": "Crocs for Women and Men: The Crocs Classic Clogs are not only the most comfortable shoes for women and men but also easy to clean just using soap and water and allowing for a quick dry. Lightweight and Fun: Experience the ultimate in lightweight comfort with these Crocs for men and women. Their iconic Crocs comfort is perfect for all-day wear, and the ventilation ports enhance breathability while quickly shedding water and debris. Designed to Fit: These slip-on clogs are easy to take on and off, while being extremely durable. These Crocs even offer pivoting heel straps for a more secure fit. Shop with Confidence: Crocs products are backed by our 90-day manufacturer's warranty for high quality and authenticity. Terms and conditions apply.",
    "reviews": [
      "Absolute comfort and effortless style: I love them! These Crocs exceeded my expectations. They're incredibly comfortable, lightweight, and perfect for all-day wear. The material is durable, easy to clean, and quick-drying, making them ideal for both lounging at home and going out. The classic white design goes with everything and looks clean and modern. Plus, the back strap helps keep your foot secure, making them more comfortable to walk in. I love that they don't cause sweat or odor, even after wearing them for several hours. Definitely a worthwhile purchase if you're looking for comfort, durability, and casual style in a single shoe.",
      "Had a difficult time trying to find white crocs in my granddaughter’s size. Apparently white is the in color among preteens. She loves them!",
      "The holes allow me to put so many charms on them.",
      "These adult Crocs are incredibly comfortable and lightweight. They fit perfectly, are easy to clean, and are great for everyday use. Excellent quality for the price!",
      "These crocs are cute but they don't fit like my other crocs, I wear a size 9 and they don't fit like that idk if these are made different but I own 4 other pairs of crocs and never had this issue",
      "So they’re nice and comfy especially if your feet hurt, but they’re ugly and especially with the color I got. I got them for $30 and the get color and for that price I can’t complain, but if you don’t mind spending the extra $20 for other colors they would be a lot better.",
      "It was a solemn friday afternoon. I was lying on the couch like a slug in summer, watching trash tv waiting for my hot pockets to stop spinning. When suddenly, it happened. I leapt up out of my chair, and rushed into the living room. Opening the door, I saw it. A beautiful brown amazon box that was packed to the brim with answers to questions I had never asked. Quickly, I snatched up the box and sprinted to my room where I then ripped off the tape with a fury only Po from the box office juggernaut Kung Fu Panda could match. After getting through the packing material, there was finally no barrier between me and my crocs. My glorious, white, mens size 11 crocs. Cautiously, I slipped them on, being careful to not upset the space time continuum. It was surreal. It felt like the world stopped spinning and nothing else mattered. I was finally the basic waterpark lifeguard I had always so desperately wanted to be.",
      "Love the color! They matched perfectly with my Philadelphia Eagles jersey. The comfort of the shoe speaks for itself.",
      "First pair of crocs I’ve ever owned! Love them, love the color. Thought it would be brighter but I’m actually glad it wasn’t as bright as I expected",
      "Great Croc clog, with a great price. Very helpful for people with hard-to-fit feet. Very comfortable and Oregon weather friendly.",
      "I bought these for my boyfriend and he absolutely loves them. Very speedy delivery too! They are true to size and very comfortable. He wears them hiking, riding, and even to work when it is too hot for boots. All around great product!",
      "Runs small. Info says they run large & to order a size smaller. I ordered the same size I have ordered the last 5 times (Women's 8/Men's 6). My past Crocs have all fit very nicely & comfortably. These do not. They are hard to slide into & extremely snug on the foot from the middle of the foot forward & also runs short in length. Heel pretty much is out of the back of the shoe. I wear a women's size 8 WW in regular shoes. As I said. When I ordered this size in the past, the fit was fine. This pair is not fine. I am returning for a refund.",
      "Bought a new pair of cross for work cause they were on sale. Yes these came in a timely manner and seemed to be authentic Crocs, however when I opened the package I got a wiff of a strong chemical odor, but it seemed to go away after a few minutes. Then when I went to try them on I noticed they were much smaller in size than my last pair. Yes I checked it was same size on the bottom. Also on the right show, the strap was not only much shorter and smaller than the left one, it had a weird deformed shape to it and it would not stay on the top of the shoe, it just kept popping up. You can see in the photo I provided. Major disappointment since I was looking forward to getting my new pair to wear at work this week. Guess I will have to look elsewhere, sorry I do not recommend from here"
    ],
    "real_image_path": "images/crocs_real.jpg"
  }
]